
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы Приход
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_АбонентскаяРабота.ДатаОкончания,
		|	ВКМ_АбонентскаяРабота.ДатаНачала,
		|	ВКМ_АбонентскаяРабота.Значение,
		|	ВКМ_АбонентскаяРабота.ИмяРеквизита
		|ИЗ
		|	РегистрСведений.ВКМ_АбонентскаяРабота КАК ВКМ_АбонентскаяРабота
		|ГДЕ
		|	ВКМ_АбонентскаяРабота.Объект = &Объект";
		
	Запрос.УстановитьПараметр("Объект", Договор);	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Выборка = РезультатЗапроса.Выбрать();
	ЗначениеСоответствие = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Значение) Тогда
			ЗначениеСоответствие.Вставить(Выборка.ИмяРеквизита,Выборка.Значение);
		ИначеЕсли ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
			ЗначениеСоответствие.Вставить("ДатаНачала",Выборка.ДатаНачала);
			ЗначениеСоответствие.Вставить("ДатаОкончания",Выборка.ДатаОкончания);		    
		КонецЕсли;
		
	КонецЦикла;	    
		    
	ДатаНачала = ЗначениеСоответствие.Получить("ДатаНачала");
	ДатаОкончания = ЗначениеСоответствие.Получить("ДатаОкончания");	
	СтоимостьЧасаРаботы = ЗначениеСоответствие.Получить("ВКМ_Стоимость_Часа_Работы");
	    
		Если ДатаНачала < Дата и ДатаОкончания > Дата	Тогда
		
			Для Каждого ТекСтрокаВыполненныеРаботы Из ВыполненныеРаботы Цикл
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов; 
				Движение.СуммаКОплате= ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы;
			КонецЦикла;
		Иначе
			
		    Сообщить("Период действия договора окончен.");
		
	    КонецЕсли;	  
	
КонецПроцедуры
