#Область ПрограмныйИнтерфейс

Функция ОбработатьВходящийЗапрос(Запрос) Экспорт
	
    ДанныеЗапроса = ДанныеЗапроса(Запрос);	

	//Если ДанныеЗапроса.Свойство("message") Тогда
	//	Возврат ВКМ_ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
	//	//ОбработатьСообщение(ДанныеЗапроса.message);
	//КонецЕсли;
    
    Возврат  ВКМ_ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьСообщение(ДанныеСообщения) Экспорт
	
	Если ДанныеСообщения.Свойство("from") Тогда
		ЗафиксироватьОтправителя(ДанныеСообщения.from);		
	КонецЕсли;
		
	Константы.ВКМ_ИдентификаторГруппыТелеграм = ДанныеСообщения.chat.id;
	
	Если ДанныеСообщения.Свойство("text") Тогда	
	    ТекстСообщения = ДанныеСообщения.text;
	Иначе
		ТекстСообщения = "Пустое сообщение";		
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("method","sendMessage");
	ДанныеОтвета.Вставить("chat_id",Константы.ВКМ_ИдентификаторГруппыТелеграм);
	ДанныеОтвета.Вставить("text",ТекстСообщения);	
    
    Возврат ВКМ_ОбщегоНазначенияHTTP.ОтветJSON(ДанныеОтвета);

КонецФункции

Функция ДанныеЗапроса(Запрос) Экспорт
	
    ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
    Возврат ВКМ_ОбщегоНазначенияHTTP.ОбъектJSON(ТелоЗапроса);

КонецФункции

Процедура ЗафиксироватьОтправителя(ДанныеОтправителя) Экспорт
	
    ИдентификаторОтправителя = ДанныеОтправителя.id;
		
	УчетнаяЗапись = Справочники.ВКМ_УчетныеЗаписиТелеграм.НайтиПоКоду(ИдентификаторОтправителя);
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;		
	КонецЕсли;
	
	ЧастиИмениПользователя = Новый Массив;
	
	Если ДанныеОтправителя.Свойство("first_name") Тогда
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.first_name);;		
	КонецЕсли;
	
	Если ДанныеОтправителя.Свойство("last_name") Тогда
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.last_name);;		
	КонецЕсли;
	
	Если ДанныеОтправителя.Свойство("username") Тогда
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.username);;		
	КонецЕсли;
	
	ИмяПользователя = СтрСоединить(ЧастиИмениПользователя," ");
	
	 
	
	СпрОбъект = Справочники.ВКМ_УчетныеЗаписиТелеграм.СоздатьЭлемент();
	СпрОбъект.Наименование = ИмяПользователя;
	СпрОбъект.Код = ИдентификаторОтправителя;
	СпрОбъект.Записать();
	
КонецПроцедуры 

#КонецОбласти