#Область ПрограмныйИнтерфейс

Функция ОбработатьВходящийЗапрос(Запрос) Экспорт
	
    ДанныеЗапроса = ДанныеЗапроса(Запрос);

    Если ДанныеЗапроса.Свойство("massage") Тогда
        Возврат ОбработатьСообщение(ДанныеЗапроса.massage);
    КонецЕсли;
    
    Возврат  ВКМ_ОбщегоНазначенияHTTP.ПростойУспешныйОтвет();
    
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьСообщение(ДанныеСообщения) Экспорт
	
	Если ДанныеСообщения.Свойство("from") Тогда
		ЗафиксироватьОтправителя(ДанныеСообщения.from);		
	КонецЕсли;
		
	ИдентификаторЧата = ДанныеСообщения.chat.id;
	
	Если ДанныеСообщения.Свойство("text") Тогда	
	    ТекстСообщения = ДанныеСообщения.text;
	Иначе
		ТекстСообщения = "Пустое сообщение";		
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("method","sendMassage");
	ДанныеОтвета.Вставить("chat_id",ИдентификаторЧата);
	ДанныеОтвета.Вставить("text",ТекстСообщения);	
    
    Возврат ВКМ_ОбщегоНазначенияHTTP.ОтветJSON(ДанныеОтвета);

КонецФункции

Функция ДанныеЗапроса(Запрос) Экспорт
	
    ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
    Возврат ВКМ_ОбщегоНазначенияHTTP.ОбъектJSON(ТелоЗапроса);

КонецФункции

Процедура ЗафиксироватьОтправителя(ДанныеОтправителя) Экспорт
	
	Идентификатор = ДанныеОтправителя.id;
	УчетнаяЗапись = Справочники.ВКМ_УчетныеЗаписиТелеграм.НайтиПоКоду(Идентификатор);
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;		
	КонецЕсли;
	
	ЧастиИмениПользователя = Новый Массив;
	
	Если ДанныеОтправителя.Свойство("first_name") Тогда
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.first_name);;		
	КонецЕсли;
	
	Если ДанныеОтправителя.Свойство("last_name") Тогда
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.last_name);;		
	КонецЕсли;
	
	Если ДанныеОтправителя.Свойство("username") Тогда
		ЧастиИмениПользователя.Добавить(ДанныеОтправителя.username);;		
	КонецЕсли;
	
	ИмяПользователя = СтрСоединить(ЧастиИмениПользователя," ");
	
	СпрОбъект = Справочники.ВКМ_УчетныеЗаписиТелеграм.СоздатьЭлемент();
	СпрОбъект.Наименование = ИмяПользователя;
	СпрОбъект.Код = Идентификатор;
	СпрОбъект.Записать();
	
КонецПроцедуры





#КонецОбласти