
&НаКлиенте
Процедура ПрисоеденитьФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.МножественныйВыбор = Ложь;
    Если Диалог.Выбрать() Тогда
        ПутьКФайлу = Диалог.ПолноеИмяФайла;
        ПозицияПоследнейТочкиВПолномИмениФайла = СтрНайти(ПутьКФайлу, ".", НаправлениеПоиска.СКонца,,1);
        ПозицияПоследнегоСловаСлева = СтрНайти(ПутьКФайлу,"\", НаправлениеПоиска.СКонца,,1);
        Расширение = Прав(ПутьКФайлу,СтрДлина(ПутьКФайлу) - ПозицияПоследнейТочкиВПолномИмениФайла);
        ФайлИмя = Сред(ПутьКФайлу, ПозицияПоследнегоСловаСлева + 1, ПозицияПоследнейТочкиВПолномИмениФайла - ПозицияПоследнегоСловаСлева - 1);    
    КонецЕсли; 
    
    Если Не ПутьКФайлу = "" Тогда
        ПрисоеденитьФайлНаСервере();
        Элементы.ВыполненныеРаботыПосмотретьФайл.Доступность = Истина;
    Иначе
        Сообщить("Файл не выбран");
    КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПрисоеденитьФайлНаСервере()
	
	  ДокументОбъект = РеквизитФормыВЗначение("Объект"); 	  
	  КоличествоСтрок = ДокументОбъект.ХранилищеФайлов.Количество();      
	  ДокументОбъект.ХранилищеФайлов.Добавить();
	  ДокументОбъект.ХранилищеФайлов[КоличествоСтрок].ФайлПуть = ПутьКФайлу;
	  ДокументОбъект.ХранилищеФайлов[КоличествоСтрок].ИмяФайла = ФайлИмя;
	  ДокументОбъект.ХранилищеФайлов[КоличествоСтрок].ФайлЗначение = Расширение;
	  ДокументОбъект.Записать();
	  ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	  
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьФайл(Команда)
		
	НомерТекущейСтроки = Элементы.ХранилищеФайлов.ТекущиеДанные.НомерСтроки;
	ПосмотретьФайлНаСервере(НомерТекущейСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПосмотретьФайлНаСервере(НомерСтроки)
	
   ДокументОбъект = РеквизитФормыВЗначение("Объект");   
   Путь = ДокументОбъект.ХранилищеФайлов[НомерСтроки-1].ФайлПуть;  
   ЗапуститьПриложение(Путь);
   ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
    
КонецПроцедуры


